/** @type {import('tailwindcss').Config} */
export default {
  theme: {
    extend: {
      
      // сейчас по стандарту
      // screens: {
      //   sm: "40rem",   // 640px
      //   md: "48rem",   // 768px
      //   lg: "64rem",   // 1024px
      //   xl: "80rem",   // 1280px
      //   "2xl": "96rem" // 1536px
      // },

      maxWidth: {
        phone: "520px", // чтобы на ноутах/мониторах UI не растягивался
      },

      colors: {
        neutral: {
          0:   "#FFFFFF",
          50:  "#F0F0FD", // переключение месяца календарь
          100: "#F6F5F6", // фон
          200: "#EBEEF6", // неактивное окно
          300: "#D4DDE9", // неактивная дата
          400: "#EBEEF6",
          500: "#8097B1", // цвет ссылок
          600: "#475569",
          700: "#334155",
          800: "#454558", // текст
          900: "#0F172A",
        },

        brand: {
          100: "#E0E7FF",
          200: "#CDD3F8", // выбранный элемент в меню
          300: "#AFBAF5", // неактивная кнопка
          400: "#818CF8",
          500: "#666FE8", // основной акцент
        },

        green: {
          50:  "#ECFDF5",
          100: "#D1FAE5",
          500: "#10B981",
          700: "#00BB83",
        },

        orange: {
          50:  "#FFFBEB",
          100: "#FEF3C7",
          500: "#F3A950",
          600: "#F3A950",
        },

        red: {
          50:  "#FEF2F2",
          100: "#F1D7E2", // кнопка отменить
          300: "#DE5D93", // цвет текста отменить
          700: "#FF0000", // ошибка
        },
      },

      borderRadius: {
        xl: "16px",
        "2xl": "20px",
      },

      boxShadow: {
        card: "0 1px 2px rgb(0 0 0 / 0.06)",
        sheet: "0 12px 30px rgb(0 0 0 / 0.14)",
      },
    },
  },
}
